;***************************************************************
;* TMS320C2000 C/C++ Codegen                         PC v4.1.3 *
;* Date/Time created: Wed Feb 03 15:53:54 2021                 *
;***************************************************************
	.compiler_opts --mem_model:code=flat --mem_model:data=large --silicon_version=28 
FP	.set	XAR2

DW$CU	.dwtag  DW_TAG_compile_unit
	.dwattr DW$CU, DW_AT_producer("TMS320C2000 C/C++ Codegen PC v4.1.3 Copyright (c) 1996-2006 Texas Instruments Incorporated")
	.dwattr DW$CU, DW_AT_stmt_list(0x00)
	.dwattr DW$CU, DW_AT_TI_VERSION(0x01)
;**************************************************************
;* CINIT RECORDS                                              *
;**************************************************************
	.sect	".cinit"
	.align	1
	.field  	-2,16
	.field  	_UserPrgAddress+0,32
	.field  	4096000,32			; _UserPrgAddress @ 0


DW$1	.dwtag  DW_TAG_subprogram, DW_AT_name("SCIx_TxString"), DW_AT_symbol_name("_SCIx_TxString")
	.dwattr DW$1, DW_AT_declaration(0x01)
	.dwattr DW$1, DW_AT_external(0x01)
DW$2	.dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$36)
	.dwendtag DW$1


DW$3	.dwtag  DW_TAG_subprogram, DW_AT_name("TxPrintf"), DW_AT_symbol_name("_TxPrintf")
	.dwattr DW$3, DW_AT_declaration(0x01)
	.dwattr DW$3, DW_AT_external(0x01)
DW$4	.dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$36)
DW$5	.dwtag  DW_TAG_unspecified_parameters
	.dwendtag DW$3



;***************************************************************
	.global	_SCIx_TxString
	.global	_TxPrintf
	.global	_SCIx_TxChar
	.global	_SCIx_RxChar
	.global	_Flash2809_Program
	.global	_Flash2809_APIVersionHex
	.global	_Flash2809_Erase
	.global	_Flash2809_APIVersion
	.global	_Flash_CPUScaleFactor
	.global	_memset
	.global	_DownLoadingHex
	.global	FS$$CMP

;***************************************************************
;* TYPE INFORMATION                                            *
;***************************************************************
DW$T$3	.dwtag  DW_TAG_pointer_type
	.dwattr DW$T$3, DW_AT_address_class(0x16)

DW$T$31	.dwtag  DW_TAG_subroutine_type, DW_AT_type(*DW$T$3)
	.dwattr DW$T$31, DW_AT_language(DW_LANG_C)
DW$98	.dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$3)
DW$99	.dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$10)
DW$100	.dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$30)
	.dwendtag DW$T$31


DW$T$34	.dwtag  DW_TAG_subroutine_type
	.dwattr DW$T$34, DW_AT_language(DW_LANG_C)
DW$101	.dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$33)
	.dwendtag DW$T$34


DW$T$37	.dwtag  DW_TAG_subroutine_type
	.dwattr DW$T$37, DW_AT_language(DW_LANG_C)
DW$102	.dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$36)
	.dwendtag DW$T$37


DW$T$39	.dwtag  DW_TAG_subroutine_type
	.dwattr DW$T$39, DW_AT_language(DW_LANG_C)
DW$103	.dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$36)
DW$104	.dwtag  DW_TAG_unspecified_parameters
	.dwendtag DW$T$39


DW$T$41	.dwtag  DW_TAG_subroutine_type
	.dwattr DW$T$41, DW_AT_language(DW_LANG_C)
DW$T$10	.dwtag  DW_TAG_base_type, DW_AT_name("int")
	.dwattr DW$T$10, DW_AT_encoding(DW_ATE_signed)
	.dwattr DW$T$10, DW_AT_byte_size(0x01)
DW$T$11	.dwtag  DW_TAG_base_type, DW_AT_name("unsigned int")
	.dwattr DW$T$11, DW_AT_encoding(DW_ATE_unsigned)
	.dwattr DW$T$11, DW_AT_byte_size(0x01)
DW$T$20	.dwtag  DW_TAG_typedef, DW_AT_name("Uint16"), DW_AT_type(*DW$T$11)
	.dwattr DW$T$20, DW_AT_language(DW_LANG_C)

DW$T$52	.dwtag  DW_TAG_subroutine_type, DW_AT_type(*DW$T$20)
	.dwattr DW$T$52, DW_AT_language(DW_LANG_C)
DW$105	.dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$20)
DW$106	.dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$51)
	.dwendtag DW$T$52

DW$T$53	.dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$20)
	.dwattr DW$T$53, DW_AT_address_class(0x16)

DW$T$54	.dwtag  DW_TAG_subroutine_type, DW_AT_type(*DW$T$20)
	.dwattr DW$T$54, DW_AT_language(DW_LANG_C)
DW$107	.dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$53)
DW$108	.dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$53)
DW$109	.dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$19)
DW$110	.dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$51)
	.dwendtag DW$T$54


DW$T$55	.dwtag  DW_TAG_subroutine_type, DW_AT_type(*DW$T$20)
	.dwattr DW$T$55, DW_AT_language(DW_LANG_C)

DW$T$56	.dwtag  DW_TAG_subroutine_type, DW_AT_type(*DW$T$20)
	.dwattr DW$T$56, DW_AT_language(DW_LANG_C)
DW$111	.dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$33)
	.dwendtag DW$T$56


DW$T$57	.dwtag  DW_TAG_array_type, DW_AT_type(*DW$T$20)
	.dwattr DW$T$57, DW_AT_language(DW_LANG_C)
	.dwattr DW$T$57, DW_AT_byte_size(0x0a)
DW$112	.dwtag  DW_TAG_subrange_type
	.dwattr DW$112, DW_AT_upper_bound(0x09)
	.dwendtag DW$T$57

DW$113	.dwtag  DW_TAG_far_type
	.dwattr DW$113, DW_AT_type(*DW$T$20)
DW$T$58	.dwtag  DW_TAG_const_type
	.dwattr DW$T$58, DW_AT_type(*DW$113)
DW$T$49	.dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$11)
	.dwattr DW$T$49, DW_AT_address_class(0x16)
DW$T$61	.dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$60)
	.dwattr DW$T$61, DW_AT_address_class(0x16)
DW$T$13	.dwtag  DW_TAG_base_type, DW_AT_name("unsigned long")
	.dwattr DW$T$13, DW_AT_encoding(DW_ATE_unsigned)
	.dwattr DW$T$13, DW_AT_byte_size(0x02)
DW$T$19	.dwtag  DW_TAG_typedef, DW_AT_name("Uint32"), DW_AT_type(*DW$T$13)
	.dwattr DW$T$19, DW_AT_language(DW_LANG_C)

DW$T$73	.dwtag  DW_TAG_subroutine_type, DW_AT_type(*DW$T$19)
	.dwattr DW$T$73, DW_AT_language(DW_LANG_C)
DW$114	.dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$20)
	.dwendtag DW$T$73

DW$T$30	.dwtag  DW_TAG_typedef, DW_AT_name("size_t"), DW_AT_type(*DW$T$13)
	.dwattr DW$T$30, DW_AT_language(DW_LANG_C)
DW$T$16	.dwtag  DW_TAG_base_type, DW_AT_name("float")
	.dwattr DW$T$16, DW_AT_encoding(DW_ATE_float)
	.dwattr DW$T$16, DW_AT_byte_size(0x02)
DW$T$77	.dwtag  DW_TAG_typedef, DW_AT_name("float32"), DW_AT_type(*DW$T$16)
	.dwattr DW$T$77, DW_AT_language(DW_LANG_C)

DW$T$78	.dwtag  DW_TAG_subroutine_type, DW_AT_type(*DW$T$77)
	.dwattr DW$T$78, DW_AT_language(DW_LANG_C)
DW$T$50	.dwtag  DW_TAG_typedef, DW_AT_name("FLASH_ST"), DW_AT_type(*DW$T$21)
	.dwattr DW$T$50, DW_AT_language(DW_LANG_C)
DW$T$51	.dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$50)
	.dwattr DW$T$51, DW_AT_address_class(0x16)
DW$115	.dwtag  DW_TAG_far_type
	.dwattr DW$115, DW_AT_type(*DW$T$88)
DW$T$89	.dwtag  DW_TAG_volatile_type
	.dwattr DW$T$89, DW_AT_type(*DW$115)
DW$T$33	.dwtag  DW_TAG_base_type, DW_AT_name("signed char")
	.dwattr DW$T$33, DW_AT_encoding(DW_ATE_signed_char)
	.dwattr DW$T$33, DW_AT_byte_size(0x01)
DW$T$36	.dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$33)
	.dwattr DW$T$36, DW_AT_address_class(0x16)

DW$T$92	.dwtag  DW_TAG_subroutine_type, DW_AT_type(*DW$T$33)
	.dwattr DW$T$92, DW_AT_language(DW_LANG_C)

DW$T$93	.dwtag  DW_TAG_subroutine_type, DW_AT_type(*DW$T$33)
	.dwattr DW$T$93, DW_AT_language(DW_LANG_C)
DW$116	.dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$33)
	.dwendtag DW$T$93

DW$117	.dwtag  DW_TAG_far_type
	.dwattr DW$117, DW_AT_type(*DW$T$33)
DW$T$94	.dwtag  DW_TAG_const_type
	.dwattr DW$T$94, DW_AT_type(*DW$117)

DW$T$60	.dwtag  DW_TAG_array_type, DW_AT_type(*DW$T$59)
	.dwattr DW$T$60, DW_AT_language(DW_LANG_C)
	.dwattr DW$T$60, DW_AT_byte_size(0x20)
DW$118	.dwtag  DW_TAG_subrange_type
	.dwattr DW$118, DW_AT_upper_bound(0x1f)
	.dwendtag DW$T$60


DW$T$21	.dwtag  DW_TAG_structure_type
	.dwattr DW$T$21, DW_AT_byte_size(0x04)
DW$119	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
	.dwattr DW$119, DW_AT_name("FirstFailAddr"), DW_AT_symbol_name("_FirstFailAddr")
	.dwattr DW$119, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$119, DW_AT_accessibility(DW_ACCESS_public)
DW$120	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$20)
	.dwattr DW$120, DW_AT_name("ExpectedData"), DW_AT_symbol_name("_ExpectedData")
	.dwattr DW$120, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
	.dwattr DW$120, DW_AT_accessibility(DW_ACCESS_public)
DW$121	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$20)
	.dwattr DW$121, DW_AT_name("ActualData"), DW_AT_symbol_name("_ActualData")
	.dwattr DW$121, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
	.dwattr DW$121, DW_AT_accessibility(DW_ACCESS_public)
	.dwendtag DW$T$21

DW$T$88	.dwtag  DW_TAG_typedef, DW_AT_name("HEX_FIELD"), DW_AT_type(*DW$T$29)
	.dwattr DW$T$88, DW_AT_language(DW_LANG_C)
DW$122	.dwtag  DW_TAG_far_type
	.dwattr DW$122, DW_AT_type(*DW$T$11)
DW$T$59	.dwtag  DW_TAG_volatile_type
	.dwattr DW$T$59, DW_AT_type(*DW$122)

DW$T$29	.dwtag  DW_TAG_structure_type
	.dwattr DW$T$29, DW_AT_byte_size(0x2a)
DW$123	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$20)
	.dwattr DW$123, DW_AT_name("DataLength"), DW_AT_symbol_name("_DataLength")
	.dwattr DW$123, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$123, DW_AT_accessibility(DW_ACCESS_public)
DW$124	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$26)
	.dwattr DW$124, DW_AT_name("Address"), DW_AT_symbol_name("_Address")
	.dwattr DW$124, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
	.dwattr DW$124, DW_AT_accessibility(DW_ACCESS_public)
DW$125	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$20)
	.dwattr DW$125, DW_AT_name("RecordType"), DW_AT_symbol_name("_RecordType")
	.dwattr DW$125, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr DW$125, DW_AT_accessibility(DW_ACCESS_public)
DW$126	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$20)
	.dwattr DW$126, DW_AT_name("Checksum"), DW_AT_symbol_name("_Checksum")
	.dwattr DW$126, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
	.dwattr DW$126, DW_AT_accessibility(DW_ACCESS_public)
DW$127	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$27)
	.dwattr DW$127, DW_AT_name("Status"), DW_AT_symbol_name("_Status")
	.dwattr DW$127, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
	.dwattr DW$127, DW_AT_accessibility(DW_ACCESS_public)
DW$128	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$20)
	.dwattr DW$128, DW_AT_name("ErrorCnt"), DW_AT_symbol_name("_ErrorCnt")
	.dwattr DW$128, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
	.dwattr DW$128, DW_AT_accessibility(DW_ACCESS_public)
DW$129	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$20)
	.dwattr DW$129, DW_AT_name("FrameNumber"), DW_AT_symbol_name("_FrameNumber")
	.dwattr DW$129, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr DW$129, DW_AT_accessibility(DW_ACCESS_public)
DW$130	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$28)
	.dwattr DW$130, DW_AT_name("ErrorFrame"), DW_AT_symbol_name("_ErrorFrame")
	.dwattr DW$130, DW_AT_data_member_location[DW_OP_plus_uconst 0x9]
	.dwattr DW$130, DW_AT_accessibility(DW_ACCESS_public)
	.dwendtag DW$T$29


DW$T$28	.dwtag  DW_TAG_array_type, DW_AT_type(*DW$T$20)
	.dwattr DW$T$28, DW_AT_language(DW_LANG_C)
	.dwattr DW$T$28, DW_AT_byte_size(0x20)
DW$131	.dwtag  DW_TAG_subrange_type
	.dwattr DW$131, DW_AT_upper_bound(0x1f)
	.dwendtag DW$T$28

DW$T$26	.dwtag  DW_TAG_typedef, DW_AT_name("DIVIDE_LONG"), DW_AT_type(*DW$T$23)
	.dwattr DW$T$26, DW_AT_language(DW_LANG_C)
DW$T$27	.dwtag  DW_TAG_typedef, DW_AT_name("BYTE_DEF"), DW_AT_type(*DW$T$25)
	.dwattr DW$T$27, DW_AT_language(DW_LANG_C)

DW$T$23	.dwtag  DW_TAG_union_type
	.dwattr DW$T$23, DW_AT_byte_size(0x02)
DW$132	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
	.dwattr DW$132, DW_AT_name("Long"), DW_AT_symbol_name("_Long")
	.dwattr DW$132, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$132, DW_AT_accessibility(DW_ACCESS_public)
DW$133	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$22)
	.dwattr DW$133, DW_AT_name("Word"), DW_AT_symbol_name("_Word")
	.dwattr DW$133, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$133, DW_AT_accessibility(DW_ACCESS_public)
	.dwendtag DW$T$23


DW$T$25	.dwtag  DW_TAG_union_type
	.dwattr DW$T$25, DW_AT_byte_size(0x01)
DW$134	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$20)
	.dwattr DW$134, DW_AT_name("all"), DW_AT_symbol_name("_all")
	.dwattr DW$134, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$134, DW_AT_accessibility(DW_ACCESS_public)
DW$135	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$24)
	.dwattr DW$135, DW_AT_name("Bit"), DW_AT_symbol_name("_Bit")
	.dwattr DW$135, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$135, DW_AT_accessibility(DW_ACCESS_public)
	.dwendtag DW$T$25


DW$T$22	.dwtag  DW_TAG_structure_type
	.dwattr DW$T$22, DW_AT_byte_size(0x02)
DW$136	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$20)
	.dwattr DW$136, DW_AT_name("Low"), DW_AT_symbol_name("_Low")
	.dwattr DW$136, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x10)
	.dwattr DW$136, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$136, DW_AT_accessibility(DW_ACCESS_public)
DW$137	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$20)
	.dwattr DW$137, DW_AT_name("High"), DW_AT_symbol_name("_High")
	.dwattr DW$137, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x10)
	.dwattr DW$137, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
	.dwattr DW$137, DW_AT_accessibility(DW_ACCESS_public)
	.dwendtag DW$T$22


DW$T$24	.dwtag  DW_TAG_structure_type
	.dwattr DW$T$24, DW_AT_byte_size(0x01)
DW$138	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$20)
	.dwattr DW$138, DW_AT_name("bit0"), DW_AT_symbol_name("_bit0")
	.dwattr DW$138, DW_AT_bit_offset(0x0f), DW_AT_bit_size(0x01)
	.dwattr DW$138, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$138, DW_AT_accessibility(DW_ACCESS_public)
DW$139	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$20)
	.dwattr DW$139, DW_AT_name("bit1"), DW_AT_symbol_name("_bit1")
	.dwattr DW$139, DW_AT_bit_offset(0x0e), DW_AT_bit_size(0x01)
	.dwattr DW$139, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$139, DW_AT_accessibility(DW_ACCESS_public)
DW$140	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$20)
	.dwattr DW$140, DW_AT_name("bit2"), DW_AT_symbol_name("_bit2")
	.dwattr DW$140, DW_AT_bit_offset(0x0d), DW_AT_bit_size(0x01)
	.dwattr DW$140, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$140, DW_AT_accessibility(DW_ACCESS_public)
DW$141	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$20)
	.dwattr DW$141, DW_AT_name("bit3"), DW_AT_symbol_name("_bit3")
	.dwattr DW$141, DW_AT_bit_offset(0x0c), DW_AT_bit_size(0x01)
	.dwattr DW$141, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$141, DW_AT_accessibility(DW_ACCESS_public)
DW$142	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$20)
	.dwattr DW$142, DW_AT_name("bit4"), DW_AT_symbol_name("_bit4")
	.dwattr DW$142, DW_AT_bit_offset(0x0b), DW_AT_bit_size(0x01)
	.dwattr DW$142, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$142, DW_AT_accessibility(DW_ACCESS_public)
DW$143	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$20)
	.dwattr DW$143, DW_AT_name("bit5"), DW_AT_symbol_name("_bit5")
	.dwattr DW$143, DW_AT_bit_offset(0x0a), DW_AT_bit_size(0x01)
	.dwattr DW$143, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$143, DW_AT_accessibility(DW_ACCESS_public)
DW$144	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$20)
	.dwattr DW$144, DW_AT_name("bit6"), DW_AT_symbol_name("_bit6")
	.dwattr DW$144, DW_AT_bit_offset(0x09), DW_AT_bit_size(0x01)
	.dwattr DW$144, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$144, DW_AT_accessibility(DW_ACCESS_public)
DW$145	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$20)
	.dwattr DW$145, DW_AT_name("bit7"), DW_AT_symbol_name("_bit7")
	.dwattr DW$145, DW_AT_bit_offset(0x08), DW_AT_bit_size(0x01)
	.dwattr DW$145, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$145, DW_AT_accessibility(DW_ACCESS_public)
	.dwendtag DW$T$24


	.dwattr DW$79, DW_AT_external(0x01)
	.dwattr DW$91, DW_AT_external(0x01)
	.dwattr DW$33, DW_AT_external(0x01)
	.dwattr DW$33, DW_AT_type(*DW$T$19)
	.dwattr DW$30, DW_AT_external(0x01)
	.dwattr DW$30, DW_AT_type(*DW$T$33)
	.dwattr DW$88, DW_AT_external(0x01)
	.dwattr DW$83, DW_AT_external(0x01)
	.dwattr DW$84, DW_AT_external(0x01)
	.dwattr DW$41, DW_AT_external(0x01)
	.dwattr DW$41, DW_AT_type(*DW$T$20)
	.dwattr DW$29, DW_AT_external(0x01)
	.dwattr DW$CU, DW_AT_language(DW_LANG_C)

;***************************************************************
;* DWARF CIE ENTRIES                                           *
;***************************************************************

DW$CIE	.dwcie 1, 40
	.dwcfa	0x0c, 20, 0
	.dwcfa	0x07, 0
	.dwcfa	0x07, 1
	.dwcfa	0x07, 2
	.dwcfa	0x07, 3
	.dwcfa	0x07, 4
	.dwcfa	0x07, 5
	.dwcfa	0x08, 6
	.dwcfa	0x08, 7
	.dwcfa	0x08, 8
	.dwcfa	0x08, 9
	.dwcfa	0x08, 10
	.dwcfa	0x08, 11
	.dwcfa	0x07, 12
	.dwcfa	0x07, 13
	.dwcfa	0x07, 14
	.dwcfa	0x07, 15
	.dwcfa	0x07, 16
	.dwcfa	0x07, 17
	.dwcfa	0x07, 18
	.dwcfa	0x07, 19
	.dwcfa	0x07, 20
	.dwcfa	0x07, 21
	.dwcfa	0x07, 22
	.dwcfa	0x07, 23
	.dwcfa	0x07, 24
	.dwcfa	0x07, 25
	.dwcfa	0x07, 26
	.dwcfa	0x08, 27
	.dwcfa	0x07, 28
	.dwcfa	0x07, 29
	.dwcfa	0x07, 30
	.dwcfa	0x07, 31
	.dwcfa	0x07, 32
	.dwcfa	0x07, 33
	.dwcfa	0x07, 34
	.dwcfa	0x07, 35
	.dwcfa	0x07, 36
	.dwcfa	0x07, 37
	.dwcfa	0x07, 38
	.dwcfa	0x07, 39
	.dwcfa	0x07, 40

;***************************************************************
;* DWARF REGISTER MAP                                          *
;***************************************************************

DW$146	.dwtag  DW_TAG_assign_register, DW_AT_name("AL")
	.dwattr DW$146, DW_AT_location[DW_OP_reg0]
DW$147	.dwtag  DW_TAG_assign_register, DW_AT_name("AH")
	.dwattr DW$147, DW_AT_location[DW_OP_reg1]
DW$148	.dwtag  DW_TAG_assign_register, DW_AT_name("PL")
	.dwattr DW$148, DW_AT_location[DW_OP_reg2]
DW$149	.dwtag  DW_TAG_assign_register, DW_AT_name("PH")
	.dwattr DW$149, DW_AT_location[DW_OP_reg3]
DW$150	.dwtag  DW_TAG_assign_register, DW_AT_name("AR0")
	.dwattr DW$150, DW_AT_location[DW_OP_reg4]
DW$151	.dwtag  DW_TAG_assign_register, DW_AT_name("XAR0")
	.dwattr DW$151, DW_AT_location[DW_OP_reg5]
DW$152	.dwtag  DW_TAG_assign_register, DW_AT_name("AR1")
	.dwattr DW$152, DW_AT_location[DW_OP_reg6]
DW$153	.dwtag  DW_TAG_assign_register, DW_AT_name("XAR1")
	.dwattr DW$153, DW_AT_location[DW_OP_reg7]
DW$154	.dwtag  DW_TAG_assign_register, DW_AT_name("AR2")
	.dwattr DW$154, DW_AT_location[DW_OP_reg8]
DW$155	.dwtag  DW_TAG_assign_register, DW_AT_name("XAR2")
	.dwattr DW$155, DW_AT_location[DW_OP_reg9]
DW$156	.dwtag  DW_TAG_assign_register, DW_AT_name("AR3")
	.dwattr DW$156, DW_AT_location[DW_OP_reg10]
DW$157	.dwtag  DW_TAG_assign_register, DW_AT_name("XAR3")
	.dwattr DW$157, DW_AT_location[DW_OP_reg11]
DW$158	.dwtag  DW_TAG_assign_register, DW_AT_name("AR4")
	.dwattr DW$158, DW_AT_location[DW_OP_reg12]
DW$159	.dwtag  DW_TAG_assign_register, DW_AT_name("XAR4")
	.dwattr DW$159, DW_AT_location[DW_OP_reg13]
DW$160	.dwtag  DW_TAG_assign_register, DW_AT_name("AR5")
	.dwattr DW$160, DW_AT_location[DW_OP_reg14]
DW$161	.dwtag  DW_TAG_assign_register, DW_AT_name("XAR5")
	.dwattr DW$161, DW_AT_location[DW_OP_reg15]
DW$162	.dwtag  DW_TAG_assign_register, DW_AT_name("AR6")
	.dwattr DW$162, DW_AT_location[DW_OP_reg16]
DW$163	.dwtag  DW_TAG_assign_register, DW_AT_name("XAR6")
	.dwattr DW$163, DW_AT_location[DW_OP_reg17]
DW$164	.dwtag  DW_TAG_assign_register, DW_AT_name("AR7")
	.dwattr DW$164, DW_AT_location[DW_OP_reg18]
DW$165	.dwtag  DW_TAG_assign_register, DW_AT_name("XAR7")
	.dwattr DW$165, DW_AT_location[DW_OP_reg19]
DW$166	.dwtag  DW_TAG_assign_register, DW_AT_name("SP")
	.dwattr DW$166, DW_AT_location[DW_OP_reg20]
DW$167	.dwtag  DW_TAG_assign_register, DW_AT_name("XT")
	.dwattr DW$167, DW_AT_location[DW_OP_reg21]
